const { getAccessToken, postSendTemplate } = require('../request/module/template')

class Template {
  async sendTemplate(ctx) {
    const { access_token } = await getAccessToken()

    let params = ctx.request.body
    console.log('params', params);
    const res = await postSendTemplate(access_token, {
      shopping_name: {
        value: "帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水帅发购买了两套阿里安优美离子烫,三十支染膏,视同洗发洗发水",
        color: "#FFC0CB"
      }
    })
    console.log('res', res);
    ctx.body = {
      code: 200,
      message: "通知商家成功"
    }
  }
}

module.exports = new Template();
